In [1]:
import pandas

In [2]:
import pandas as pd

In [64]:
df = pd.DataFrame({'players': ['Virat', 'Rohit', 'Pant', 'Ishan', 'Pollard', 'ABD'], 'runs': [54, 36, 70, 20, 10, 100], 'balls': [30, 31, 50, 23, 15, 50]})

In [65]:
df

   players  runs  balls
0    Virat    54     30
1    Rohit    36     31
2     Pant    70     50
3    Ishan    20     23
4  Pollard    10     15
5      ABD   100     50

In [66]:
df['players']

0      Virat
1      Rohit
2       Pant
3      Ishan
4    Pollard
5        ABD
Name: players, dtype: object

In [67]:
cols_list = ['players','runs','balls']

In [68]:
df[cols_list]

   players  runs  balls
0    Virat    54     30
1    Rohit    36     31
2     Pant    70     50
3    Ishan    20     23
4  Pollard    10     15
5      ABD   100     50

In [69]:
df.players

0      Virat
1      Rohit
2       Pant
3      Ishan
4    Pollard
5        ABD
Name: players, dtype: object

In [70]:
df.players[2]

'Pant'

In [71]:
df[df.players == 'Pant'].runs

2    70
Name: runs, dtype: int64

In [72]:
playersNumber = len(df)
playerDataNumber = len(df.columns)

In [73]:
for i in range(0,playersNumber):
    print(df.players[i],'scored',df.runs[i],'runs in',df.balls[i],'balls at a strike rate of',round(100*df.runs[i]/df.balls[i],2))

Virat scored 54 runs in 30 balls at a strike rate of 180.0
Rohit scored 36 runs in 31 balls at a strike rate of 116.13
Pant scored 70 runs in 50 balls at a strike rate of 140.0
Ishan scored 20 runs in 23 balls at a strike rate of 86.96
Pollard scored 10 runs in 15 balls at a strike rate of 66.67
ABD scored 100 runs in 50 balls at a strike rate of 200.0